Revit 2024 API
ParameterValueProvider Properties
The ParameterValueProvider type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from FilterableValueProvider.)
Parameter
 The parameter used to provide a string, integer, double-precision, or ElementId value on request for a given element.
See Also
ParameterValueProvider Class
Autodesk.Revit.DB Namespace